<?php
namespace anlutro\Menu\Util;

class StringUtils
{
	public static function slug($string, $separator = '-')
	{
		foreach (static::charsArray() as $key => $value) {
			$string = str_replace($value, $key, $string);
		}

		$string = preg_replace('/[^\x20-\x7E]/u', '', $string);

		// convert all dashes/underscores into separator
		$flip = ($separator == '-') ? '_' : '-';

		$string = preg_replace('!['.preg_quote($flip).']+!u', $separator, $string);

		// remove all characters that are not the separator, letters, numbers, or whitespace.
		$string = preg_replace('![^'.preg_quote($separator).'\pL\pN\s]+!u', '', mb_strtolower($string));

		// replace all separator characters and whitespace by a single separator
		$string = preg_replace('!['.preg_quote($separator).'\s]+!u', $separator, $string);

		return trim($string, $separator);
	}

	protected static function charsArray()
	{
		static $charsArray;
		if (isset($charsArray)) return $charsArray;

		return $charsArray = array(
			'a'    => array(
							'à', 'á', 'ả', 'ã', 'ạ', 'ă', 'ắ', 'ằ', 'ẳ', 'ẵ',
							'ặ', 'â', 'ấ', 'ầ', 'ẩ', 'ẫ', 'ậ', 'ä', 'ā', 'ą',
							'å', 'α', 'ά', 'ἀ', 'ἁ', 'ἂ', 'ἃ', 'ἄ', 'ἅ', 'ἆ',
							'ἇ', 'ᾀ', 'ᾁ', 'ᾂ', 'ᾃ', 'ᾄ', 'ᾅ', 'ᾆ', 'ᾇ', 'ὰ',
							'ά', 'ᾰ', 'ᾱ', 'ᾲ', 'ᾳ', 'ᾴ', 'ᾶ', 'ᾷ', 'а'),
			'b'    => array('б', 'β'),
			'c'    => array('ç', 'ć', 'č', 'ĉ', 'ċ'),
			'd'    => array('ď', 'ð', 'đ', 'ƌ', 'ȡ', 'ɖ', 'ɗ', 'ᵭ', 'ᶁ', 'ᶑ',
							'д'),
			'e'    => array('é', 'è', 'ẻ', 'ẽ', 'ẹ', 'ê', 'ế', 'ề', 'ể', 'ễ',
							'ệ', 'ë', 'ē', 'ę', 'ě', 'ĕ', 'ė', 'ε', 'έ', 'ἐ',
							'ἑ', 'ἒ', 'ἓ', 'ἔ', 'ἕ', 'ὲ', 'έ', 'е', 'ё', 'э',
							'є'),
			'f'    => array('ф'),
			'g'    => array('ĝ', 'ğ', 'ġ', 'ģ', 'г', 'ґ'),
			'h'    => array('ĥ', 'ħ'),
			'i'    => array('í', 'ì', 'ỉ', 'ĩ', 'ị', 'î', 'ï', 'ī', 'ĭ', 'į',
							'ı', 'ι', 'ί', 'ϊ', 'ΐ', 'ἰ', 'ἱ', 'ἲ', 'ἳ', 'ἴ',
							'ἵ', 'ἶ', 'ἷ', 'ὶ', 'ί', 'ῐ', 'ῑ', 'ῒ', 'ΐ', 'ῖ',
							'ῗ', 'і', 'ї', 'и'),
			'j'    => array('ĵ'),
			'k'    => array('ķ', 'ĸ', 'к'),
			'l'    => array('ł', 'ľ', 'ĺ', 'ļ', 'ŀ', 'л'),
			'm'    => array('м'),
			'n'    => array('ñ', 'ń', 'ň', 'ņ', 'ŉ', 'ŋ', 'ν', 'н'),
			'o'    => array('ó', 'ò', 'ỏ', 'õ', 'ọ', 'ô', 'ố', 'ồ', 'ổ', 'ỗ',
							'ộ', 'ơ', 'ớ', 'ờ', 'ở', 'ỡ', 'ợ', 'ø', 'ō', 'ő',
							'ŏ', 'ο', 'ὀ', 'ὁ', 'ὂ', 'ὃ', 'ὄ', 'ὅ', 'ὸ', 'ό',
							'ö', 'о'),
			'p'    => array('п'),
			'r'    => array('ŕ', 'ř', 'ŗ', 'р'),
			's'    => array('ś', 'š', 'ş', 'с'),
			't'    => array('ť', 'ţ', 'т'),
			'u'    => array('ú', 'ù', 'ủ', 'ũ', 'ụ', 'ư', 'ứ', 'ừ', 'ử', 'ữ',
							'ự', 'ü', 'û', 'ū', 'ů', 'ű', 'ŭ', 'ų', 'µ', 'у'),
			'v'    => array('в'),
			'w'    => array('ŵ'),
			'y'    => array('ý', 'ỳ', 'ỷ', 'ỹ', 'ỵ', 'ÿ', 'ŷ', 'й', 'ы'),
			'z'    => array('ź', 'ž', 'ż', 'з'),
			'ch'   => array('ч'),
			'kh'   => array('х'),
			'oe'   => array('œ'),
			'sh'   => array('ш'),
			'shch' => array('щ'),
			'ts'   => array('ц'),
			'ya'   => array('я'),
			'yu'   => array('ю'),
			'zh'   => array('ж'),
			'A'    => array('Á', 'À', 'Ả', 'Ã', 'Ạ', 'Ă', 'Ắ', 'Ằ', 'Ẳ', 'Ẵ',
							'Ặ', 'Â', 'Ấ', 'Ầ', 'Ẩ', 'Ẫ', 'Ậ', 'Ä', 'Å', 'Ā',
							'Ą', 'Α', 'Ά', 'Ἀ', 'Ἁ', 'Ἂ', 'Ἃ', 'Ἄ', 'Ἅ', 'Ἆ',
							'Ἇ', 'ᾈ', 'ᾉ', 'ᾊ', 'ᾋ', 'ᾌ', 'ᾍ', 'ᾎ', 'ᾏ', 'Ᾰ',
							'Ᾱ', 'Ὰ', 'Ά', 'ᾼ', 'А'),
			'B'    => array('Б'),
			'C'    => array('Ć', 'Č', 'Ĉ', 'Ċ'),
			'D'    => array('Ď', 'Ð', 'Đ', 'Ɖ', 'Ɗ', 'Ƌ', 'ᴅ', 'ᴆ', 'Д'),
			'E'    => array('É', 'È', 'Ẻ', 'Ẽ', 'Ẹ', 'Ê', 'Ế', 'Ề', 'Ể', 'Ễ',
							'Ệ', 'Ë', 'Ē', 'Ę', 'Ě', 'Ĕ', 'Ė', 'Ε', 'Έ', 'Ἐ',
							'Ἑ', 'Ἒ', 'Ἓ', 'Ἔ', 'Ἕ', 'Έ', 'Ὲ', 'Е', 'Ё', 'Э',
							'Є'),
			'F'    => array('Ф'),
			'G'    => array('Ğ', 'Ġ', 'Ģ', 'Г', 'Ґ'),
			'I'    => array('Í', 'Ì', 'Ỉ', 'Ĩ', 'Ị', 'Î', 'Ï', 'Ī', 'Ĭ', 'Į',
							'İ', 'Ι', 'Ί', 'Ϊ', 'Ἰ', 'Ἱ', 'Ἳ', 'Ἴ', 'Ἵ', 'Ἶ',
							'Ἷ', 'Ῐ', 'Ῑ', 'Ὶ', 'Ί', 'И', 'І', 'Ї'),
			'K'    => array('К'),
			'L'    => array('Ĺ', 'Ł', 'Л'),
			'M'    => array('М'),
			'N'    => array('Ń', 'Ñ', 'Ň', 'Ņ', 'Ŋ', 'Н'),
			'O'    => array('Ó', 'Ò', 'Ỏ', 'Õ', 'Ọ', 'Ô', 'Ố', 'Ồ', 'Ổ', 'Ỗ',
							'Ộ', 'Ơ', 'Ớ', 'Ờ', 'Ở', 'Ỡ', 'Ợ', 'Ö', 'Ø', 'Ō',
							'Ő', 'Ŏ', 'Ο', 'Ό', 'Ὀ', 'Ὁ', 'Ὂ', 'Ὃ', 'Ὄ', 'Ὅ',
							'Ὸ', 'Ό', 'О'),
			'P'    => array('П'),
			'R'    => array('Ř', 'Ŕ', 'Р'),
			'S'    => array('Ş', 'Ŝ', 'Ș', 'Š', 'Ś', 'С'),
			'T'    => array('Ť', 'Ţ', 'Ŧ', 'Ț', 'Т'),
			'U'    => array('Ú', 'Ù', 'Ủ', 'Ũ', 'Ụ', 'Ư', 'Ứ', 'Ừ', 'Ử', 'Ữ',
							'Ự', 'Û', 'Ü', 'Ū', 'Ů', 'Ű', 'Ŭ', 'Ų', 'У'),
			'V'    => array('В'),
			'Y'    => array('Ý', 'Ỳ', 'Ỷ', 'Ỹ', 'Ỵ', 'Ÿ', 'Ῠ', 'Ῡ', 'Ὺ', 'Ύ',
							'Ы', 'Й'),
			'Z'    => array('Ź', 'Ž', 'Ż', 'З'),
			'CH'   => array('Ч'),
			'KH'   => array('Х'),
			'SH'   => array('Ш'),
			'SHCH' => array('Щ'),
			'TS'   => array('Ц'),
			'YA'   => array('Я'),
			'YU'   => array('Ю'),
			'ZH'   => array('Ж'),
			' '    => array("\xC2\xA0", "\xE2\x80\x80", "\xE2\x80\x81",
							"\xE2\x80\x82", "\xE2\x80\x83", "\xE2\x80\x84",
							"\xE2\x80\x85", "\xE2\x80\x86", "\xE2\x80\x87",
							"\xE2\x80\x88", "\xE2\x80\x89", "\xE2\x80\x8A",
							"\xE2\x80\xAF", "\xE2\x81\x9F", "\xE3\x80\x80"),
		);
	}
}
